//===========================================================
//
// ギミック処理:ボタン連打[gimmcik.cpp]
// Author : 大原　怜将
//
//===========================================================
#include "gimmickButtonMash.h"
#include "objectX.h"

//===========================================================
// コンストラクタ
//===========================================================
CGimmickButtonMash::CGimmickButtonMash(D3DXVECTOR3 pos, int nPriority)
{

}

//===========================================================
// デストラクタ
//===========================================================
CGimmickButtonMash::~CGimmickButtonMash()
{

}

//===========================================================
// 初期化処理
//===========================================================
HRESULT CGimmickButtonMash::Init(void)
{

	return S_OK;
}

//===========================================================
// 終了処理
//===========================================================
void CGimmickButtonMash::Uninit(void)
{

}

//===========================================================
// 更新処理
//===========================================================
void CGimmickButtonMash::Update(void)
{
	
}

//===========================================================
// 描画処理
//===========================================================
void CGimmickButtonMash::Draw(void)
{

}

//===========================================================
// 生成処理
//===========================================================
CGimmickButtonMash* CGimmickButtonMash::Create(D3DXVECTOR3 pos)
{
	CGimmickButtonMash* pGimmick = new CGimmickButtonMash(pos);

	if (pGimmick != nullptr)
	{
		pGimmick->Init();
		pGimmick->m_pObjectX = CObjectX::Create("data\\MODEL\\Field\\rock.x", pos);
	}

	return pGimmick;
}