//===========================================================
//
// パーティクル処理[particl.cpp]
// Author 大原怜将
//
//===========================================================
#include "main.h"
#include "renderer.h"
#include "object.h"
#include "manager.h"
#include "particle.h"
#include <time.h>

//===========================================================
// 定数定義
//===========================================================
namespace
{
	const int BLOOD = 1;        // 血液のパーティクル
	const int GROUND = 20;      // 土煙のパーティクル
	const int CIRCLE = 314;     // 円形のパーティクル
	const float SPEED = 10.0f;  // 移動量
}

//===========================================================
//静的メンバ変数宣言
//===========================================================
LPDIRECT3DTEXTURE9 CParticle::m_pTexture = nullptr;

//===========================================================
// コンストラクタ
//===========================================================
CParticle::CParticle()
{
	m_pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
	m_fRadius = 0;
	m_nLife = 0;
}

//===========================================================
// コンストラクタ
//===========================================================
CParticle::CParticle(D3DXVECTOR3 pos, TYPE type)
{
	m_pos = pos;
	m_fRadius = 0;
	m_nLife = 0;
	m_type = type;
}

//===========================================================
// デストラクタ
//===========================================================
CParticle::~CParticle()
{

}

//===========================================================
// 生成処理
//===========================================================
CParticle *CParticle::Create(D3DXVECTOR3 pos, TYPE type)
{
	//オブジェクト2Dのポインタ
	CParticle *pParticl = NULL;

	if (pParticl == NULL)
	{
		//オブジェクト2Dの生成
		pParticl = new CParticle(pos, type);

		//初期化処理
		pParticl->Init();
	}
	
	return pParticl;
}

//===========================================================
// 初期化処理
//===========================================================
HRESULT CParticle::Init(void)
{
	

	return S_OK;
}

//===========================================================
// 終了処理
//===========================================================
void CParticle::Uninit(void)
{
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}

//===========================================================
// 更新処理
//===========================================================
void CParticle::Update(void)
{
	
}

//===========================================================
// 描画処理
//===========================================================
void CParticle::Draw(void)
{
	
}

//===========================================================
// 描画処理
//===========================================================
void CParticle::Move(void)
{
	//乱数の種を設定
	srand((unsigned int)time(0));

	for (int nCnt = 0; nCnt < 10; nCnt++)
	{
		float fMove, fRot;

		fMove = (float)(rand() % 50) / 100.0f * 8.0f;
		fRot = (float)(rand() % 629 - 314) / 100.0f;

		m_move.x = sinf(fRot) * fMove;
		m_move.y = cosf(fRot) * fMove;
		m_move.z = cosf(fRot) * fMove;

		//CEffect::Create(pos, { m_move.x, m_move.y, m_move.z }, { 0.8f, 1.0f, 1.0f, 1.0f }, m_fRadius, 30, CEffect::TYPEEFF_NONE);
	}
}